overset/submerge/domain/constant/dynamicMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1806                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      dynamicMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

motionSolverLibs    ("libsixDoFRigidBodyMotion.so");

dynamicFvMesh       dynamicOversetFvMesh;

dynamicOversetFvMeshCoeffs
{
}

solver          sixDoFRigidBodyMotion;

sixDoFRigidBodyMotionCoeffs
{

    patches         (floatingObject);
    innerDistance   100.0;
    outerDistance   101.0;

    centreOfMass    (0 0 0);

    // Cuboid dimensions
    

    // Density of the solid
    rhoSolid        780;

    // Cuboid mass
    mass            0.40872;

    // Cuboid moment of inertia about the centre of mass
    momentOfInertia (1.21327e-05 1.21327e-05 1.21327e-05);
    velocity (0 0 0);
    report          on;
    accelerationRelaxation 0.6;

    solver
    {
        type Newmark;
    }

    constraints
    {

        
        /*fixedPoint
        {
             sixDoFRigidBodyMotionConstraint point;
             centreOfRotation (0.5 0.45 0.1);
        }*/
        

        /*fixedLine
        {
            sixDoFRigidBodyMotionConstraint line;
            //centreOfRotation (0.5 0.45 0.1);
            direction (0 0 1);
        }*/

        
        /*fixedAxis
        {
            sixDoFRigidBodyMotionConstraint axis;
            axis (1 1 1);
        }*/
	/*arrestRotation
 	{
   		sixDoFRigidBodyMotionConstraint   orientation;
   		
 	}*/

        
    }
}

// ************************************************************************* //
